; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star10 - direction
	GroundStation11 - direction
	Star8 - direction
	Star7 - direction
	Star3 - direction
	GroundStation9 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star8)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star7)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared1)
	(have_image Phenomenon14 infrared1)
	(have_image Planet15 infrared1)
	(have_image Star16 spectrograph0)
	(have_image Planet17 infrared1)
	(have_image Star18 infrared1)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 7
3. (turn_to satellite0 planet13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet13)
   goals met: 0 of 7
4. (take_image satellite0 planet13 instrument2 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 1 of 7
5. (turn_to satellite0 phenomenon14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon14 instrument2 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon12 instrument2 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 3 of 7
9. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 3 of 7
10. (take_image satellite0 planet15 instrument2 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 4 of 7
11. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 4 of 7
12. (take_image satellite0 planet17 instrument2 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 5 of 7
13. (turn_to satellite0 star16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star16)
   goals met: 5 of 7
14. (take_image satellite0 star16 instrument2 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 6 of 7
15. (turn_to satellite0 star18 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star18)
   goals met: 6 of 7
16. (take_image satellite0 star18 instrument2 infrared1)
   added: (have_image star18 infrared1)
   goals met: 7 of 7
